[
    {
        "title": "Dell Inspiron Touchscreen Laptop, 15.6\" Business & Student Laptop Computer, Windows 11 Pro Laptop 32GB RAM 1TB SSD, Intel i5-1155G7 Processor, Full HD IPS Display, Numeric Keypad, HDMI, Carbon Black",
        "product_id": "B0CTPCTW66",
        "price": "$514.97",
        "image_url": "https://m.media-amazon.com/images/I/61Wc1fDGJuL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Dell-Inspiron-Touchscreen-i5-1155G7-Processor/dp/B0CTPCTW66",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "269 global ratings",
        "histogram": {
            "5_star": "66%",
            "4_star": "17%",
            "3_star": "4%",
            "2_star": "3%",
            "1_star": "10%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 2,
            "3_star": 0,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "TJ",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 16, 2025",
                "review_text": "I bought the 40GB RAM with 2TB and I love it.  Fairly easy to set up, speed is awesome, very light weight, battery life is pretty good.  I would highly recommend this as a great deal for the price."
            },
            {
                "reviewer_name": "Michael Nolan",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 13, 2025",
                "review_text": "Excellent laptop! Fast and convenient. I couldn't ask for a better computer. The Windows 11 is a bit different from the W 10 I have been used to, but after a short time I have found it to be better and seemingly simpler in some ways."
            },
            {
                "reviewer_name": "Old JW",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 24, 2025",
                "review_text": "I am enjoying this new computer. It is much quicker than my previous computer and it has many more features for me to use and enjoy. It was priced right and delivered as promised."
            },
            {
                "reviewer_name": "Angel A. O. Ortiz",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 26, 2025",
                "review_text": "A great price for a 40 GB Ram and 2 TB memory. Great for all purposes, business, trading, emulators, Google meet and all features."
            },
            {
                "reviewer_name": "Dale",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 12, 2025",
                "review_text": "Nice Dell Laptop with allthe features."
            },
            {
                "reviewer_name": "Rebecca Jacobson",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "Great product and a decent price…"
            },
            {
                "reviewer_name": "Gerald C Vale",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 10, 2025",
                "review_text": "It was a gift for our son and he is very happy with it"
            },
            {
                "reviewer_name": "AnMo917",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 1, 2025",
                "review_text": "Ease of use for high school or college student. It's light weight and a nice resolution touch screen. The 15.6 inch screen size is perfect it's not too big or too small. Not the best graphics card but not bad if used for simple videos or zoom. Great work laptop."
            },
            {
                "reviewer_name": "JAT",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 31, 2025",
                "review_text": "This item was advertised as having Microsoft 11 pro. It is 11 home.  Upon initial set up was unable to login to welcome screen. Took it to a local tech to fix this - paid out of pocket for repair. On board speakers did not work. Went to Dell support to download a new driver which resolved the problem. Otherwise, so far, I like the screen size and performance of the laptop. My intended use is casual, personal for home."
            },
            {
                "reviewer_name": "Thomas Going",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 9, 2025",
                "review_text": "BUYER BEWARE OF DELL, AMAZON AND THIRD PARTY SELLERS ON AMAZON.  And extended warranty company Asurion.Amazon's  practice of listing and selling products like Dell computers for third party sellers seems like a scam, since the third party seller can sell old products on Amazon where the warranty is already expired or almost so.  And I saw nothing on AMAZON's site when I bought the DELL computer that things like an expired or limited time warranty could be an issue when buying ON AMAZON from a third party seller.Bought this Dell computer on Amazon, July 16, 2024, and Jan.3, 2025 the screen separated from the cover.  Contacted Dell, and they advised the WARRANTY was EXPIRED!  That's less than 6 months.  Dell said the AMAZON third party seller resold the computer on AMAZON months after it bought the computer, and the warranty began to run earlier when the third party seller bought the computer. Not when I purchased the computer on Amazon!Spent hours on the phone with Dell, and they know about this issue with third party sellers.  Even after providing them with the Amazon invoice and receipt of when I took possession of the computer, they would not help me and apply and run the warranty to the date I bought the computer from Amazon.Amazon's rep basically said sorry, but that's my problem for buying from a third party seller. Say what?  I bought the computer on AMAZON and paid AMAZON.  Now I'm out of luck?To make matters worse, I bought an extended warranty on Amazon from Asurion on the same day I bought the Dell computer on Amazon.  When I tried to make a claim, Asurion auto responded that the Dell computer still has the manufactures warranty and to contact Dell, seemingly as a result of only having purchased the computer from Amazon in July.  And not taking into account that the warranty started to run when the third party seller bought the computer months earlier.Shame on Dell, Amazon, and Asurion."
            }
        ],
        "review_summary": "The laptop offers excellent performance, lightweight design, and great value for money, though customers have faced issues with incorrect specifications and warranty complications from third-party sellers.",
        "pos_5_aspects": ["PRICE", "PERFORMANCE", "BUILD_QUALITY"],
        "neg_5_aspects": [],
    "pos_4_aspects": ["BATTERY", "BUILD_QUALITY"],
    "neg_4_aspects": ["PORTABILITY"],
    "pos_3_aspects": ["DESIGN"],
    "neg_3_aspects": ["AUDIO"],
    "pos_2_aspects": [],
    "neg_2_aspects": ["PRICE"],
    "pos_1_aspects": [],
    "neg_1_aspects": []
    },
    {
        "title": "Dell Latitude 3550 Laptop Computer for Business and Work, 13th Gen Intel 10-Core i5-1335U (Beat i7-1255U), 32GB DDR5 RAM, 1TB PCIe SSD, 15.6\" FHD, WiFi 6E, Bluetooth 5.3, USB4 Type-C, Windows 11 Pro",
        "product_id": "B0CTKKHKR3",
        "price": "$799.00",
        "image_url": "https://m.media-amazon.com/images/I/81RuYfizHuL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Dell-Latitude-3540-i7-1195G7-Bluetooth/dp/B0CTKKHKR3",
        "average_rating": "4.4 out of 5 stars",
        "review_count": "46 global ratings",
        "histogram": {
            "5_star": "82%",
            "4_star": "6%",
            "1_star": "12%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 8,
            "4_star": 1,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "default_character",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 7, 2024",
                "review_text": "This is a nice little laptop for when you're travelling, which is why I purchased it.  Good price and quick delivery; free support for a while (forgot how long).  No issues when starting it up for the first time, just the regular annoying Windows quirks; seemed that you had to have a Microsoft email account already set up, because I was unable to configure one by following the prompts on the install.  But we all know about MS issues.  No problems getting my critical Windows 10 software installed.  I gave up on getting the MS tools (like Outlook, Excel, Word) re-installed, because of all the license junk they add on to make it impossible (let's just call it \"Bill's revenge,\" ok?  Instead, I used Thunderbird for email (wow!!!!), and Google for the docs.  Way less of a pain.Crisp and clear screen -- really amazing.  Great SSD storage size, and very light.  Haven't tried to use unplugged for an afternoon, but I'm supposing it'll function.  Keyboard is kind of ok; fine for travelling, but not sure about using 24x7.  Blazingly fast, and 32GB of memory is awesome."
            },
            {
                "reviewer_name": "Ben",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on September 15, 2024",
                "review_text": "Purchased this laptop as my personal laptop when I retired. Setup was easy and it is working great."
            },
            {
                "reviewer_name": "James E. O'Brien",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on October 28, 2024",
                "review_text": "I am delighted with this product. The ease and comfort of set up shocked me in its simplicity. The connectivity is so precise that I hardly had to lift a finger in order to load - and instantly use - the programs, software and apps I use regularly. The machine simply went out and transferred the connections that had been in place in my previous machine, once it had securely verified and confirmed my identity and the validity of my access. When I think of the old days of installing this, that and the other...In addition, the speed of operation, the storage capacity and system stability are a dream come true. I only regret having waited as long as I did to upgrade machines."
            },
            {
                "reviewer_name": "Michael A Schall",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 2, 2025",
                "review_text": "This is the same brand and model that I use at work. I don't want to mix personal and business browsing. I like this brand and model of computer. Thank you."
            },
            {
                "reviewer_name": "Thomas",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 13, 2024",
                "review_text": "The keyboard is lit and using the mouse adds the the speed of this Dell laptop!  Large hard drive and memory add to faster performance!"
            },
            {
                "reviewer_name": "Robert C. Cochran",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on August 18, 2024",
                "review_text": "Dell Latitude 3540 15.6\" Laptop is a great quality product and an outstanding value for the money."
            },
            {
                "reviewer_name": "S. Barefield",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on October 31, 2024",
                "review_text": "I use a dell computer for work, so I knew what to expect. I love this computer. Does everything I need to do for home use."
            },
            {
                "reviewer_name": "MJC",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 22, 2024",
                "review_text": "Dell is always a best in class buy"
            },
            {
                "reviewer_name": "Kate",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on October 14, 2019",
                "review_text": "This computer is used for word processing and design work. It has the capacity to manage large amounts of photo and video data."
            },
            {
                "reviewer_name": "Verified purchase",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 17, 2024",
                "review_text": "It was shipped to the Philippines from USA. We paid extra shipping fee so it will come early but it arrived 2 days late than expected and the package arrived open box and has scratches on the side and no warranty card just like when you buy at Dell directly. Setting up was awful. We got blue screen and kernel security problem and it froze and had to reboot it hard and turned on and upon doing something a blue screen popped up again experiencing problem again. Talk to agent and nobody could help. Will return if not fixed in a month’s time.Update: So much it caused us just to return this item. Beware of the return label especially if it’s outside USA as you have to pay for your shipment because the waybill number would be invalid. We have returned it after 2 months. Also make sure ask the seller to provide you with MSDS form as it is needed to process your return. I don’t recommend buying from 3rd party seller or marketplace seller like Tech Plus Pro as Dell won’t recognize your laptop for warranty even if it’s brand new. We’ll see if they will refund me fully and even the shipping fee and import fees. I will update soon.Update: They are refusing to refund me. They got the item back and asking for paper work that customer impossible to provide and now no refund. Terrible customer service and return policy."
            }
        ],
        "review_summary": "The laptop is praised for its portability, ease of setup, performance, and value, though some users experienced issues with customer service and returns when purchased from third-party sellers.",
        "pos_5_aspects": ["PRICE", "PERFORMANCE", "BUILD_QUALITY"],
        "neg_5_aspects": [],
    "pos_4_aspects": ["BATTERY", "BUILD_QUALITY"],
    "neg_4_aspects": ["PORTABILITY"],
    "pos_3_aspects": ["DESIGN"],
    "neg_3_aspects": ["AUDIO"],
    "pos_2_aspects": [],
    "neg_2_aspects": ["PRICE"],
    "pos_1_aspects": [],
    "neg_1_aspects": []
    },
    {
        "title": "Dell Inspiron 15 3000 3520 Business Laptop Computer[Windows 11 Pro], 15.6'' FHD Touchscreen, 11th Gen Intel Quad-Core i5-1135G7, 16GB RAM, 1TB PCIe SSD, Numeric Keypad, Wi-Fi, Webcam, HDMI, Black",
        "product_id": "B0CC936WF1",
        "price": "$489.00",
        "image_url": "https://m.media-amazon.com/images/I/71gbrvRJI-L._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Dell-Laptop-Touchscreen-Quad-Core-i5-1135G7/dp/B0CC936WF1",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "364 global ratings",
        "histogram": {
            "5_star": "65%",
            "4_star": "15%",
            "3_star": "6%",
            "2_star": "3%",
            "1_star": "11%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "P Brac",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 22, 2025",
                "review_text": "I like Dell laptops, with touchscreen, runs faster than my old machine. All the features I wanted ."
            },
            {
                "reviewer_name": "Mark F.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 11, 2024",
                "review_text": "I've been using Dell laptops, workstations and servers and network switches for 3 decades. In this time, I've had one server motherboard replaced under warranty and all the other hardware goes way past its life expectancy with some equipment running a decade or more without issues. You simply can't go wrong with a Dell product. My laptop has been running flawless and the build quality is outstanding as with all of their other products.Buy it !"
            },
            {
                "reviewer_name": "Angela Conti",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 25, 2025",
                "review_text": "My business laptop's hard drive crashed. I ordered this one until I could find another. It's fast and has a nice battery life for a second work laptop."
            },
            {
                "reviewer_name": "M. Pelland",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 7, 2025",
                "review_text": "I returned three \"refurbished\" Amazon laptops--very annoying and time consuming. Each had problems. In days gone by, refurbished or renewed electronics were a good value and dependable. I gave up and chose the new model of this Dell. Win 11. It is exactly what I need with no issues, no problems. The keyboard lights up. The cover is attractive. The unit works perfectly. Buy new--it's worth it."
            },
            {
                "reviewer_name": "Karmen KG",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 29, 2025",
                "review_text": "this is very fast, light, and small not too small but enough to read well"
            },
            {
                "reviewer_name": "Omar",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 7, 2025",
                "review_text": "Excelente equipo,tiene muy buenas propiedades, muy rapida,buen precio la recomiendo 100%"
            },
            {
                "reviewer_name": "Jeff",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 6, 2025",
                "review_text": "I've had several Dell computers over the years.  My last laptop was an hp and broke after only three years.  The back of the base cracked.  It was usable but I could not close the cover.  The speed was also slow.  After doing some research, I found this Dell model.  The hp was bigger and that posed some problems.  This size is better.  The only drawback that I didn't notice when I ordered is that it does not have backlit keys.  Other dells have had this and once you have, it you get spoiled.  For now, it's been great."
            },
            {
                "reviewer_name": "Joe Bios",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 21, 2024",
                "review_text": "I purchased a Dell 3520 Win 11 Pro from a reseller \"Like New\". A few things folks might find helpful. 1. Dell sells a limited set of configurations (Memory, SSD, etc), so resellers open the laptop to \"upgrade\" memory, SSD to offer more choice in configurations. Of course, this begs the question what components are being installed. In my case the components were reasonable: 16GB Samsung DDR4 3200 memory and WD Green 1TB SSD, but its \"reasonable\" to check the delivered system. 2. Microsoft defaults to keeping a \"remarkable\" amount of information about your activities, like every app installed, every webpage viewed, etc., so I strongly suggest logging into your Microsoft account (account.microsoft.com) and turn on every privacy control they provide. Then clear the accumulated history and log into the account in a day or so and check if they stopped accumulating data. 3. Windows PRO provides S Mode which is a restrictive version of Windows (only M$ store apps, lighter weight process controls etc). This is mostly for PCs going to less than trusted employees. Turning off S Mode is a one-way trip, i.e. it cannot be reenabled (essentially forever). The system I receive had S Mode off. This is something I would have done anyway, but it's something to consider if you need S Mode for employee users."
            },
            {
                "reviewer_name": "Amazon Customer",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 6, 2025",
                "review_text": "this dell computer does work well. the volume keys do not work, I downloaded an app and have problems with it. I would like to return this dell computer. I can not get the apps. that I am use to. I need a computer that I can the apps. that I need. I also need to update my grand daughter Tandem insulin pump and can do it on this computer. I can do this on a computer that has play store on it. The pump need to be updated before the end of this month. I have 2 computers picked out in my cart to choice from. THIS IS VERY IMPORTANT THAT I GET INSULIN PUMP IS VERY NECCESARY TO MY GRAND DAUGHTER.  THANK YOU VERY MUCHI am so sorry, I did see your  report and credit to my account. I would like to send back to you. please send me a return label so I can print it out and send back to you.  Like I said I AM SO SORRY I DID SEE THE RETURN TO ME  THANK YOU VERY MUCHI received the new computer and returning the dell computer in the box the new computer was in.  How do i return it back, do I need a return label"
            },
            {
                "reviewer_name": "Capt. C.",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on June 11, 2024",
                "review_text": "I can only begin this review with serious misgivings about this particular Dell Inspirion laptop.  When one purchases a product from a \"Dell Vendor\", one presumes it is a 100% Dell product.  Apparently this was not the case with this laptop.  Exactly 3 days after the Amazon/Vendor's return policy ran out, this laptop stopped working.  The error message was \"Corrupt Hard Drive\".  I can understand electronic devices will sometimes have issues.  I can also understand manufacturers and vendors need to have a limit on how long they will allow items to be returned.  So we called Dell Warranty Service, and they were very helpful.  They sent a box, pre-paid shipping label and we thought that would be the end of it.  Wait a reasonable time for the laptop to be repaired under warranty, and we could go on with our lives.  NOT SO.  According to the Dell Warranty Center, this particular laptop has a 3rd Party Hard Drive.  Not a hard-drive provided by Dell or installed by Dell or used by Dell.  So... our laptop was... in fact... not able to be repaired under warranty.  Dell has offered to fix the laptop and install the correct, but the repair is nearly as much as the laptop cost new from Amazon.  This is totally unacceptable!  When we bought the laptop, we presumed it was a new Dell Laptop with appropriately sourced and installed electronics that would be approved by Dell (or installed by Dell)... BUYER BEWARE of ROKC Electronics.  They have offered NO Help,  NO Sympathy,  and we are now completely out of the money we spent, and have a laptop that is absolutely Useless!!!!  I can only imagine if we were still in the window for return, they would put the same Non-Dell parts back in, and we would be facing similar issues down the road.  This is not the way to run a business.  And certainly not the way an Amazon vendor should be doing business.  Very Very Very Disappointed!"
            }
        ],
        "review_summary": "The laptop reviews highlight strong satisfaction with Dell products, emphasizing their speed, reliability, and build quality, but also caution against third-party models due to potential hardware issues.",
        "pos_5_aspects": ["PRICE", "PERFORMANCE", "BUILD_QUALITY"],
        "neg_5_aspects": [],
    "pos_4_aspects": ["BATTERY", "BUILD_QUALITY"],
    "neg_4_aspects": ["PORTABILITY"],
    "pos_3_aspects": ["DESIGN"],
    "neg_3_aspects": ["AUDIO"],
    "pos_2_aspects": [],
    "neg_2_aspects": ["PRICE"],
    "pos_1_aspects": [],
    "neg_1_aspects": []
    }
]